tbd_app_api/app/controllers/advices_controller.rb

  def index
    @advices = Advice.all
---
SELECT "advices".* FROM "advices"

  def create
    @advice = Advice.new(advice_params)

    if @advice.save
---
INSERT INTO "advices" ("name", "advice", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bri"], ["advice", "have fun"], ["created_at", "2020-08-10 20:22:43.011242"], ["updated_at", "2020-08-10 20:22:43.011242"]]

  def update
    if @advice.update(advice_params)
---
UPDATE "advices" SET "advice" = $1, "updated_at" = $2 WHERE "advices"."id" = $3  [["advice", "have fun and enjoy"], ["updated_at", "2020-08-10 20:23:36.569416"], ["id", 7]]

  def destroy
    @advice.destroy
---
DELETE FROM "advices" WHERE "advices"."id" = $1  [["id", 7]]

    def set_advice
      @advice = Advice.find(params[:id])
---
SELECT "advices".* FROM "advices" WHERE "advices"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]